conf/src/InformationRegisters/ЭП_НастройкаУведомленийОбОтсутствииОценокУСотрудников/ЭП_НастройкаУведомленийОбОтсутствииОценокУСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_НастройкаУведомленийОбОтсутствииОценокУСотрудников</name>
  <resources>
    <name>УведомленияПоОценкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_ОтветственныеЗаОценкуЭффективности/ЭП_ОтветственныеЗаОценкуЭффективности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ОтветственныеЗаОценкуЭффективности</name>
  <resources>
    <name>ПрофильОценивания</name>
    <type>
      <types>CatalogRef.ЭП_ПрофилиОценивания</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>УДАЛИТЬ_ОУП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйПрофиль</name>
    <type>
      <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/InformationRegisters/ЭП_ЭффективностьСотрудников/ЭП_ЭффективностьСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ЭффективностьСотрудников</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодОценивания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрофильРасчета</name>
    <type>
      <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/CommonModules/ЭП_ОбщегоНазначенияСервер/Module.bsl
&НаСервере
Функция ПроверитьУникальностьОбъектаПоРеквизитам(ВидОбъекта, ИмяОбъекта, СтрРеквизитов, СсылкаНаОбъект) Экспорт 
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
	    "ВЫБРАТЬ ПЕРВЫЕ 1
	    |    Объект.Ссылка
	    |ИЗ
	    |    " + ВидОбъекта + "." + ИмяОбъекта + " КАК Объект
	    |ГДЕ
	    |    Объект.Ссылка <> &СсылкаНаОбъект
	    |"; 
	
	Для Каждого ТекРек Из СтрРеквизитов Цикл  
		
        Параметр = " = &Пар" + ТекРек.Ключ;
        Запрос.Текст = Запрос.Текст + " И Объект." + ТекРек.Ключ + Параметр; 
        Запрос.УстановитьПараметр("Пар" + ТекРек.Ключ, ТекРек.Значение); 
		
	КонецЦикла;  
	
    Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);        
    РезультатЗапроса = Запрос.Выполнить();
	
    Возврат РезультатЗапроса.Пустой();  
		
КонецФункции

Функция КоличествоСторудниковБезОценок() Экспорт
	
	ТекущаяДата = ТекущаяДатаСеанса();
	КонецПериода = КонецМесяца(ТекущаяДата);
	НачалоПериода = НачалоМесяца(ТекущаяДата);
	
	Если ТекущаяДата < (НачалоПериода + 5 * 24 * 3600) ИЛИ ТекущаяДата > (НачалоПериода + 14 * 24 * 3600) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Ответственный = Пользователи.ТекущийПользователь(); 
	ЗначениеУведомления = Ложь;
	
	Если Пользователи.РолиДоступны("ЭП_НастройкиУведомленийОбОтсутсвииОценокУСотрудников") Тогда
		МенеджерЗаписи = РегистрыСведений.ЭП_НастройкаУведомленийОбОтсутствииОценокУСотрудников.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = Ответственный;
		МенеджерЗаписи.Прочитать();
		ЗначениеУведомления = МенеджерЗаписи.УведомленияПоОценкам;
	КонецЕсли;
	
	Если Не ЗначениеУведомления Тогда
    	Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ОтветственныеЗаОценкуЭффективности.Проект КАК Проект,
		|	ЭП_ОтветственныеЗаОценкуЭффективности.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЭП_ОтветственныеЗаОценкуЭффективности КАК ЭП_ОтветственныеЗаОценкуЭффективности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЭП_ЭффективностьСотрудников КАК ЭП_ЭффективностьСотрудников
		|		ПО ЭП_ОтветственныеЗаОценкуЭффективности.Ответственный = ЭП_ЭффективностьСотрудников.Ответственный
		|			И ЭП_ОтветственныеЗаОценкуЭффективности.Проект = ЭП_ЭффективностьСотрудников.Проект
		|			И ЭП_ОтветственныеЗаОценкуЭффективности.Сотрудник = ЭП_ЭффективностьСотрудников.Сотрудник
		|ГДЕ
		|	ЭП_ОтветственныеЗаОценкуЭффективности.Ответственный = &Ответственный
		|	И (ЭП_ЭффективностьСотрудников.Значение ЕСТЬ NULL
		|			ИЛИ ЭП_ЭффективностьСотрудников.ПериодОценивания >= &НачалоПериода
		|				И ЭП_ЭффективностьСотрудников.ПериодОценивания <= &КонецПериода И ЭП_ЭффективностьСотрудников.Значение = 0)";
	
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	
	Если ТекущаяДата <= (НачалоПериода + 15 * 24 * 3600) Тогда
		НачалоПериода = НачалоМесяца(НачалоПериода - 1);
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат  Выборка.Количество();

КонецФункции 

Функция ПолучитьСсылкуНаОбработкуПроставленияОценок() Экспорт

	НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Метаданные.Обработки.ЭП_ВводПоказателейЭффективностиПоПроектнымСпискам);
	Возврат НавигационнаяСсылка;
	
КонецФункции
